#### Terraform Plan for `terraform/s3`
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Resource Changes</summary>

<h4>Directory: terraform/s3</h4>
<table>
<tr><th>Resource</th><th>Action</th><th>Type</th></tr>
<tr><td>module.s3_bucket.aws_s3_bucket.this[0]</td><td>create</td><td>aws_s3_bucket</td></tr>
<tr><td>module.s3_bucket.aws_s3_bucket_acl.this[0]</td><td>create</td><td>aws_s3_bucket_acl</td></tr>
<tr><td>module.s3_bucket.aws_s3_bucket_object_lock_configuration.this[0]</td><td>create</td><td>aws_s3_bucket_object_lock_configuration</td></tr>
<tr><td>module.s3_bucket.aws_s3_bucket_public_access_block.this[0]</td><td>create</td><td>aws_s3_bucket_public_access_block</td></tr>
<tr><td>module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0]</td><td>create</td><td>aws_s3_bucket_server_side_encryption_configuration</td></tr>
<tr><td>module.s3_bucket.aws_s3_bucket_versioning.this[0]</td><td>create</td><td>aws_s3_bucket_versioning</td></tr>
</table>

</details>

<details><summary>Show Full Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-s3-bucket-example-unique-name"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = true
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Owner"       = "terraform"
          + "Project"     = "my-project"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Owner"       = "terraform"
          + "Project"     = "my-project"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_object_lock_configuration.this[0] will be created
  + resource "aws_s3_bucket_object_lock_configuration" "this" {
      + bucket              = (known after apply)
      + id                  = (known after apply)
      + object_lock_enabled = "Enabled"

      + rule {
          + default_retention {
              + days = 30
              + mode = "COMPLIANCE"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_arn                = (known after apply)
  + s3_bucket_bucket_domain_name = (known after apply)
  + s3_bucket_id                 = (known after apply)
stdout<<ghadelimiter_e6bf9bb9-3ee1-47ca-9a56-9940a1b395a1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-s3-bucket-example-unique-name"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = true
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Owner"       = "terraform"
          + "Project"     = "my-project"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Owner"       = "terraform"
          + "Project"     = "my-project"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_object_lock_configuration.this[0] will be created
  + resource "aws_s3_bucket_object_lock_configuration" "this" {
      + bucket              = (known after apply)
      + id                  = (known after apply)
      + object_lock_enabled = "Enabled"

      + rule {
          + default_retention {
              + days = 30
              + mode = "COMPLIANCE"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_arn                = (known after apply)
  + s3_bucket_bucket_domain_name = (known after apply)
  + s3_bucket_id                 = (known after apply)

ghadelimiter_e6bf9bb9-3ee1-47ca-9a56-9940a1b395a1
stderr<<ghadelimiter_f85640d8-fab1-4e84-b940-ce67ea606c99

ghadelimiter_f85640d8-fab1-4e84-b940-ce67ea606c99
exitcode<<ghadelimiter_d6d00714-465d-4e2a-b6c7-08e0e16ad7df
0
ghadelimiter_d6d00714-465d-4e2a-b6c7-08e0e16ad7df
```

</details>